# parameters
nc: 3  # number of classes
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple


# anchors
anchors:
  - [53,54, 78,86, 110,74]  # P3/8
  - [88,146, 176,128, 134,220]  # P4/16
  - [248,286, 418,290, 576,396]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9
   [-1, 1, SimAM, [1024]],

  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],  # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
   [[-1, 6], 1, Concat, [640, 640]],  # 12
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]], # 640, 320
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [320, 320]],
   [-1, 3, C3, [256, False]],  # 17

#   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 6, 14], 1, Concat, [640, 640]],
   [-1, 3, C3, [512, False]],  # 21

#   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [1024, 3, 2]],
   [[-1, 10], 1, Concat, [1280, 1280]],
   [-1, 3, C3, [1024, False]],  # 25

#   [[17, 21, 25], 1, Detect, [nc, anchors]] # Detect(P3, P4, P5)
   [[18, 21, 24], 1, Detect, [nc, anchors]] # Detect(P3, P4, P5)
  ]

